<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'qtype_formulas', language 'ru', version '4.5'.
 *
 * @package     qtype_formulas
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['abserror'] = 'Абсолютная ошибка';
$string['addmorepartsblanks'] = 'Добавить еще части - {no}';
$string['algebraic_formula'] = 'Алгебраическая формула';
$string['allfieldsempty'] = 'Все поля ввода пусты.';
$string['answer'] = 'Ответ*';
$string['answer_help'] = '** Требование**.
Должен быть перечень чисел или список значений в зависимости от выбранного типа ответа. При единственном ответе число или значение могут быть введены непосредственно. Обратите внимание на то, что количество элементов в списке задает число полей ответа для этой части.

<pre class="prettyprint">123<br>[1, 0, 0, 1]<br>a<br>[1, a, b]<br>"exp(-a t)"<br>["vx t","vy t - 0.5 a t^2"]</pre>';
$string['answercombinedunitmulti'] = 'Ответ и единица измерения для части {$a->part}';
$string['answercombinedunitsingle'] = 'Ответ и единица измерения';
$string['answercoordinatemulti'] = 'Ответ за часть {$a->part} и координаты {$a->numanswer}';
$string['answercoordinatesingle'] = 'Ответ для координаты {$a->numanswer}';
$string['answermark'] = 'Оценка части*';
$string['answermark_help'] = '** Требование **.
Оценка за эту часть ответа должна больше 0.
По умолчанию оценка за весь вопрос - сумма оценок за все части.

Примечание: Если поле оценки этой части будет пустым, то часть будет удалена при сохранении вопроса.';
$string['answermulti'] = 'Ответ за часть {$a->part}';
$string['answerno'] = 'Часть {$a}';
$string['answernotacceptable'] = 'Этот ответ не соответствует заданному типу ответа: {$a}.';
$string['answernotunique'] = 'Есть и другие правильные ответы.';
$string['answernotunique_help'] = 'Если этот параметр отмечен, то при просмотре своей попытки студент увидит «Один из правильных ответов: ...» вместо «Правильный ответ: ...».';
$string['answersingle'] = 'Ответ';
$string['answertype'] = 'Тип ответа';
$string['answertype_help'] = 'Существует четыре типа ответов.

Ответы типа «Число», «Числовой» и «Числовая формула» требуют ввода числа или списка чисел в качестве ответа.

Ответы типа «Алгебраическая формула» требуют ввода строки или списка строк в качестве ответа.

Различные типы ответов налагают разные ограничения при вводе ответов, поэтому учащимся
необходимо знать, как их вводить. Проверка формата в коде вопроса сообщит им об ошибке, если они введут что-то неправильно.  Подробности см. в документации.';
$string['answertype_link'] = 'https://dynamiccourseware.org/';
$string['answerunitmulti'] = 'Единица измерения для части {$a->part}';
$string['answerunitsingle'] = 'Единица измерения';
$string['caretwarning'] = 'Обратите внимание, что в ответах за исключением алгебраических формул символ ^ обозначает операцию XOR (исключающее ИЛИ), . Для возведения в степень вместо него следует использовать **.';
$string['checkvarshdr'] = 'Проверка конкретизации переменных';
$string['choiceno'] = 'Нет';
$string['choiceyes'] = 'Да';
$string['commonsiunit'] = 'Общая единица СИ';
$string['correctansweris'] = 'Один из возможных правильных ответов: {$a}';
$string['correctfeedback'] = 'Для любого правильного ответа';
$string['correctfeedback_help'] = 'Этот отзыв будет показан студентам, получившим максимальный балл за данную часть. Он может содержать глобальные и локальные переменные, которые будут заменены их значениями.';
$string['correctness'] = 'Критерий оценки*';
$string['correctness_help'] = '**Требование**. Вы можете выбрать относительную или абсолютную погрешность с указанием диапазона погрешностей. Относительная погрешность не может использоваться для алгебраического типа ответа.

Для получения точного определения относительной и абсолютной погрешности при наличии более одного поля для ответа см. документацию.';
$string['correctness_link'] = 'https://dynamiccourseware.org/';
$string['correctnessexpert'] = 'Эксперт';
$string['correctnesssimple'] = 'Упрощённый режим';
$string['defaultanswermark'] = 'Оценка по умолчанию для частей';
$string['defaultanswermark_desc'] = 'Оценка по умолчанию для частей нового вопроса';
$string['defaultanswertype'] = 'Тип ответа по умолчанию';
$string['defaultanswertype_desc'] = 'Тип ответа по умолчанию для частей новых вопросов';
$string['defaultcorrectness'] = 'Критерий оценки по умолчанию';
$string['defaultcorrectness_desc'] = 'Критерий оценки по умолчанию для частей новых вопросов';
$string['defaultunitpenalty'] = 'Штраф за единицу по умолчанию';
$string['defaultunitpenalty_desc'] = 'Штраф по умолчанию за неправильную единицу (0-1)';
$string['defaultwidth_algebraic_formula'] = 'Тип ответа «Алгебраическая формула»';
$string['defaultwidth_algebraic_formula_desc'] = 'Ширина поля ввода по умолчанию для типа ответа «Алгебраическая формула»';
$string['defaultwidth_number'] = 'Тип ответа «Число»';
$string['defaultwidth_number_desc'] = 'Ширина поля ввода по умолчанию для типа ответа «Число»';
$string['defaultwidth_number_unit'] = 'Комбинированное поле «Число»';
$string['defaultwidth_number_unit_desc'] = 'Ширина комбинированного поля ввода по умолчанию для типа ответа «Число»';
$string['defaultwidth_numeric'] = 'Тип ответа «Числовой»';
$string['defaultwidth_numeric_desc'] = 'Ширина поля ввода по умолчанию для типа ответа «Числовой»';
$string['defaultwidth_numeric_unit'] = 'Комбинированное поле «Числовой»';
$string['defaultwidth_numeric_unit_desc'] = 'Ширина комбинированного поля ввода по умолчанию для типа ответа «Числовой»';
$string['defaultwidth_numerical_formula'] = 'Тип ответа «Числовая формула»';
$string['defaultwidth_numerical_formula_desc'] = 'Ширина поля ввода по умолчанию для типа ответа «Числовая формула»';
$string['defaultwidth_numerical_formula_unit'] = 'Комбинированное поле «Числовая формула»';
$string['defaultwidth_numerical_formula_unit_desc'] = 'Ширина комбинированного поля ввода по умолчанию для типа ответа «Числовая формула»';
$string['defaultwidth_unit'] = 'Поле единицы измерения';
$string['defaultwidth_unit_desc'] = 'Ширина поля отдельной единицы по умолчанию';
$string['defaultwidthunit'] = 'Длина единицы измерения';
$string['defaultwidthunit_desc'] = 'Единица длины, используемая для приведённых ниже настроек ширины по умолчанию. Единицы «em» или «rem» примерно соответствуют ширине одной цифры.';
$string['error_algebraic_relerr'] = 'Относительная погрешность (_relerr) не может использоваться с ответом типа «Алгебраическая формула».';
$string['error_algebraic_var'] = 'Синтаксическая ошибка определения алгебраической переменной.';
$string['error_algvar_numbers'] = 'Алгебраические переменные могут быть инициализированы только списком чисел.';
$string['error_answer_missing'] = 'Ответ не был определен.';
$string['error_answer_missing_in_part'] = 'Для части {$a} ответ не определен.';
$string['error_answerbox_duplicate'] = 'Заполнители полей ответов должны быть уникальными; обнаружен второй экземпляр {$a}.';
$string['error_answertype_mistmatch'] = 'Несоответствие типов ответов: для числового типа ответа требуется число, а для алгебраического — строка';
$string['error_bitshift_integer'] = 'Оператор сдвига битов следует использовать только с целыми числами.';
$string['error_bitshift_negative'] = 'Сдвиг битов на отрицательное число {$a} не допускается.';
$string['error_bitwand_integer'] = 'Побитовое AND (И) следует использовать только с целыми числами.';
$string['error_bitwor_integer'] = 'Побитовое OR (ИЛИ) следует использовать только с целыми числами.';
$string['error_bitwxor_integer'] = 'Побитовое XOR (исключающее ИЛИ) следует использовать только с целыми числами.';
$string['error_cannotusealgebraic'] = 'Алгебраическая переменная «{$a}» не может использоваться в данном контексте.';
$string['error_criterion'] = 'Критерий оценки должен быть выражен в виде одного числа.';
$string['error_criterion_empty'] = 'Критерий оценки не должен быть пустым.';
$string['error_damaged_question'] = 'Недопустимые данные. Возможно, раздел «Формулы» был поврежден, например, в ходе неудачного импорта или восстановления.';
$string['error_db_delete'] = 'Не удалось удалить запись из базы данных, таблица {$a}.';
$string['error_db_missing_options'] = 'В вопросе «Формулы» с ID {$a} отсутствовала запись с вариантами ответов. Используются значения по умолчанию.';
$string['error_db_read'] = 'Не удалось прочитать данные из базы данных, таблица {$a}.';
$string['error_db_write'] = 'Не удалось записать данные в базу данных, таблица {$a}.';
$string['error_diff_binary_function_needslist'] = 'При использовании функции map() с двоичной функцией «{$a}» хотя бы один аргумент должен быть списком.';
$string['error_diff_binary_function_two'] = 'При использовании функции map() с двоичной функцией «{$a}» требуется два аргумента.';
$string['error_diff_binary_operator_needslist'] = 'При использовании функции map() с бинарным оператором «{$a}» хотя бы один аргумент должен быть списком.';
$string['error_diff_binary_operator_two'] = 'При использовании функции map() с бинарным оператором «{$a}» требуется два аргумента.';
$string['error_diff_binary_samesize'] = 'При использовании функции map() с двумя списками, они оба должны иметь одинаковый размер.';
$string['error_diff_first'] = 'Первым аргументом функции diff() должен быть список.';
$string['error_diff_first_invalid'] = '«{$a}» не является допустимым первым аргументом для функции map().';
$string['error_diff_firstlist_content'] = 'При использовании функции diff() первый список должен содержать либо только числа, либо только строки.';
$string['error_diff_firstlist_mismatch'] = 'diff(): несоответствие типов для элемента #{$a} (с нулевым индексом) первого списка.';
$string['error_diff_function_more_args'] = 'Функция «{$a}» не может использоваться с map(), так как она принимает более двух аргументов.';
$string['error_diff_function_no_args'] = 'Функцию «{$a}» нельзя использовать с map(), так как она не принимает аргументов.';
$string['error_diff_samesize'] = 'Функция diff() принимает два списка одинакового размера.';
$string['error_diff_second'] = 'Вторым аргументом функции diff() должен быть список.';
$string['error_diff_secondlist_mismatch'] = 'diff(): несоответствие типов для элемента #{$a} (с нулевым индексом) второго списка.';
$string['error_diff_third'] = 'Третий аргумент функции diff() можно использовать только при работе со списками строк.';
$string['error_diff_unary_function'] = 'При использовании map() с унарной функцией «{$a}» допускается только один список.';
$string['error_diff_unary_needslist'] = 'При использовании функции map() с «{$a}» аргумент должен быть списком.';
$string['error_diff_unary_operator'] = 'При использовании функции map() с унарным оператором «{$a}» допускается только один список.';
$string['error_distribution_outcomes'] = '{$a} предполагает, что количество успешных результатов будет неотрицательным целым числом.';
$string['error_distribution_tries'] = '{$a} предполагает, что количество попыток будет неотрицательным целым числом.';
$string['error_divzero'] = 'Деление на ноль не допускается.';
$string['error_emptyrange'] = 'Ошибка проверки: диапазон от {$a->start} до {$a->end} с шагом {$a->step} будет пустым.';
$string['error_emptystack'] = 'Ошибка проверки: пустой стек — передано ли достаточно аргументов для функции или оператора?';
$string['error_eval_numerical'] = 'Некоторые выражения не поддаются численному вычислению.';
$string['error_evaluate_invocation'] = 'Неверное использование {$a}.';
$string['error_evaluation_unknown_nan_inf'] = 'Неизвестная ошибка при применении оператора {$a}; результатом стала (положительная или отрицательная) бесконечность либо значение, не являющееся числом (NAN).';
$string['error_expectbraceorstatement'] = 'Синтаксическая ошибка: ожидается { или оператор.';
$string['error_expectbracketorvarname'] = 'Синтаксическая ошибка: ожидается [ или имя переменной.';
$string['error_expectclosingparen'] = 'Синтаксическая ошибка: ожидается ).';
$string['error_expected_intindex'] = 'Ошибка проверки: индекс должен быть целым числом, обнаружено «{$a}».';
$string['error_expected_number'] = 'Ожидается число.';
$string['error_expected_number_found'] = 'Ожидается число, обнаружено {$a->found}.';
$string['error_expected_number_found_algebraicvar'] = 'Ожидается число, обнаружена алгебраическая переменная.';
$string['error_expected_number_found_list'] = 'Ожидается число, обнаружен список.';
$string['error_expected_scalar'] = 'Ожидается скалярное значение.';
$string['error_expected_scalar_found'] = 'Ожидается скалярное значение, обнаружено {$a->found}.';
$string['error_expected_scalar_found_algebraicvar'] = 'Ожидается скалярное значение, обнаружена алгебраическая переменная.';
$string['error_expected_scalar_found_list'] = 'Ожидается скалярное значение, обнаружен список.';
$string['error_expects_number'] = '{$a->who} ожидает число.';
$string['error_expects_number_found'] = '{$a->who} ожидает число, обнаружено {$a->found}.';
$string['error_expects_scalar'] = '{$a->who} ожидает скалярное значение.';
$string['error_expects_scalar_found'] = '{$a->who} ожидает скалярное значение, обнаружено {$a->found}.';
$string['error_fact_toolarge'] = 'На этой платформе невозможно вычислить {$a}!, так как результат превышает значение PHP_MAX_FLOAT.';
$string['error_fixed_range'] = 'Синтаксическая ошибка фиксированного диапазона.';
$string['error_for_expectcolon'] = 'Синтаксическая ошибка: ожидается :.';
$string['error_for_expectidentifier'] = 'Синтаксическая ошибка: ожидается идентификатор.';
$string['error_for_expectparen'] = 'Синтаксическая ошибка: после for ожидается (.';
$string['error_forbid_char'] = 'Формула или выражение содержат запрещенные символы или операторы.';
$string['error_forgotoperator'] = 'Синтаксическая ошибка: вы забыли поставить оператор?';
$string['error_forloop'] = 'Синтаксическая ошибка для цикла';
$string['error_forloop_expression'] = 'Выражение цикла for должно представлять собой список.';
$string['error_forloop_var'] = 'В переменной цикла for обнаружены ошибки.';
$string['error_func_all_lists'] = '{$a} ожидает, что аргументами будут списки.';
$string['error_func_argcount'] = 'Недопустимое количество аргументов для функции «{$a->function}»: передано {$a->count}.';
$string['error_func_first_int'] = '{$a} ожидает, что первый аргумент будет целым числом.';
$string['error_func_first_list'] = '{$a} ожидает, что первый аргумент будет списком.';
$string['error_func_first_nnegint'] = '{$a} ожидает, что первый аргумент будет неотрицательным целым числом.';
$string['error_func_first_number'] = '{$a} ожидает, что первый аргумент будет числом.';
$string['error_func_first_nzeroint'] = '{$a} ожидает, что первый аргумент будет ненулевым целым числом.';
$string['error_func_first_posint'] = '{$a} ожидает, что первый аргумент будет положительным целым числом.';
$string['error_func_nan'] = 'Результат функции «{$a}» не является числом.';
$string['error_func_nnegint'] = '{$a} ожидает, что аргумент будет неотрицательным целым числом.';
$string['error_func_param'] = 'Неверное количество или тип параметров для функции {$a}()';
$string['error_func_paren'] = 'Синтаксическая ошибка: после функции должна следовать открывающая скобка.';
$string['error_func_positive'] = '{$a} ожидает, что аргумент будет положительным числом.';
$string['error_func_second_int'] = '{$a} ожидает, что второй аргумент будет целым числом.';
$string['error_func_second_nnegint'] = '{$a} ожидает, что второй аргумент будет неотрицательным целым числом.';
$string['error_func_second_nzeronum'] = '{$a} ожидает, что второй аргумент будет ненулевым числом.';
$string['error_func_second_posint'] = '{$a} ожидает, что второй аргумент будет положительным целым числом.';
$string['error_func_third_posint'] = '{$a} ожидает, что третий аргумент будет положительным целым числом.';
$string['error_grading_error'] = 'Ошибка при оценке. Вероятно, это связано с некорректным файлом импорта или повреждением базы данных.';
$string['error_grading_not_one'] = 'Критерий оценки должен принимать значение 1 для правильных ответов. Вместо этого найдено {$a}.';
$string['error_grading_single_expression'] = 'Критерий оценки должен представлять собой одно выражение. Вместо этого найдены операторы - {$a}.';
$string['error_import_missing_field'] = 'Отсутствует поле: {$a}';
$string['error_import_missing_parts'] = 'Вопрос «{$a}» не содержит никаких частей.';
$string['error_in_answer'] = 'Ошибка в ответе #{$a->answerno}: {$a->message}';
$string['error_indexoutofrange'] = 'Ошибка проверки: индекс {$a} выходит за пределы допустимого диапазона.';
$string['error_inv_consec'] = 'При использовании функции inv() числа в списке должны быть последовательными.';
$string['error_inv_integers'] = 'Функция inv() ожидает, что все элементы списка являются целыми числами; числа с плавающей запятой будут усечены.';
$string['error_inv_list'] = 'Функция inv() ожидает список.';
$string['error_inv_nodup'] = 'При использовании функции inv() в списке не должно быть нескольких одинаковых чисел.';
$string['error_inv_smallest'] = 'При использовании функции inv() наименьшее число в списке должно быть равно 0 или 1.';
$string['error_invalidalgebraic'] = '«{$a}» — недопустимое алгебраическое выражение.';
$string['error_invalidargsep'] = 'Синтаксическая ошибка: некорректное использование разделительного символа «,».';
$string['error_invalidcodepoint'] = 'Недопустимая последовательность экранирования кодовой точки UTF-8.';
$string['error_invalidcodepoint_toolarge'] = 'Недопустимая последовательность экранирования кодовой точки UTF-8: кодовая точка превышает 0x10FFFF.';
$string['error_invalidcontext'] = 'Указан недопустимый контекст переменной, импорт прерван.';
$string['error_invalidrandvardef'] = 'Неверное определение случайной величины — необходимо предоставить список возможных значений.';
$string['error_invalidrangesep'] = 'Синтаксическая ошибка: некорректное использование разделителя диапазона «:».';
$string['error_invalidunary'] = 'Неправильное использование унарного оператора: {$a}.';
$string['error_invalidvarname'] = 'Недопустимое имя переменной: {$a}.';
$string['error_len_argument'] = 'Функция len() ожидает список или строку.';
$string['error_list_too_large'] = 'Список не должен содержать более {$a} элементов.';
$string['error_map_unknown'] = 'Ошибка вычисления в функции map(): {$a}';
$string['error_mark'] = 'Оценка за ответ должна быть больше 0.';
$string['error_model_answer_no_content'] = 'Некорректный ответ: в образце ответа отсутствуют символы, поддающиеся вычислению.';
$string['error_model_answer_prefix'] = 'Некорректный ответ: не используйте префиксный оператор \\ в образцах ответов для данного типа ответов.';
$string['error_no_answer'] = 'Требуется хотя бы один ответ.';
$string['error_notindexable'] = 'Ошибка проверки: индексирование возможно только для списков и строк.';
$string['error_number_for_numeric_answertypes'] = 'Неверный формат ответа: этот тип ответа ожидает одно число или список чисел.';
$string['error_onlyoneindex'] = 'Ошибка проверки: при доступе к элементам массива поддерживается только один индекс.';
$string['error_parenmismatch'] = 'Несоответствие скобок: «{$a->closer}» закрывает «{$a->opener}» в строке {$a->row} и столбце {$a->column}.';
$string['error_parennotclosed'] = 'Несбалансированная скобка: «{$a}» так и не закрывается.';
$string['error_pick_two'] = 'При вызове функции pick() с двумя аргументами, в качестве второго параметра ожидается список.';
$string['error_placeholder_format'] = 'Неправильный формат заполнителя или запрещенные символы.';
$string['error_placeholder_main_duplicate'] = 'Дублированный заполнитель в тексте вопроса.';
$string['error_placeholder_missing'] = 'Этот заполнитель отсутствует в тексте вопроса.';
$string['error_placeholder_sub_duplicate'] = 'Этот заполнитель уже был определен в другой части.';
$string['error_placeholder_too_long'] = 'Длина заполнителя ограничена 40 символами.';
$string['error_poly_one'] = 'При вызове функции poly() с одним аргументом он должен быть числом или списком чисел.';
$string['error_poly_string'] = 'При вызове функции poly() со строкой второй аргумент должен быть числом или списком чисел.';
$string['error_poly_stringlist'] = 'При вызове функции poly() со списком строк вторым аргументом должен быть список чисел.';
$string['error_poly_two'] = 'При вызове функции poly() с двумя аргументами первый должен быть строкой или списком строк.';
$string['error_power_negbase_expfrac'] = 'Основание не может быть отрицательным при дробном показателе степени.';
$string['error_power_negbase_expzero'] = 'Деление на ноль не допустимо, поэтому основание для отрицательных показателей степени не может быть равно нулю.';
$string['error_power_zerozero'] = 'Степень 0^0 не определена.';
$string['error_prefix'] = 'Синтаксическая ошибка: некорректное использование префиксного символа \\.';
$string['error_probability'] = '{$a} ожидает, что вероятность будет не менее 0 и не более 1.';
$string['error_question_damaged'] = 'Ошибка: вопрос поврежден, количество фрагментов текста и количество частей вопроса не совпадают.';
$string['error_randvars_set_size'] = 'Число порождаемых элементов в множестве должно быть больше 1.';
$string['error_randvars_type'] = 'Все элементы в наборе должны быть абсолютно одинакового типа и размера.';
$string['error_rangesyntax'] = 'Синтаксическая ошибка в определении диапазона.';
$string['error_rangeusage'] = 'Синтаксическая ошибка: диапазоны можно использовать только в фигурных скобках {} или квадратных скобках [].';
$string['error_rule'] = 'Ошибка анализа правила.';
$string['error_ruleid'] = 'В файле с указанным id/именем такого правила нет.';
$string['error_samestartend'] = 'Синтаксическая ошибка: начало и конец диапазона не должны совпадать.';
$string['error_setindividual_algebraicvar'] = 'Для алгебраических переменных настройка отдельных элементов не поддерживается.';
$string['error_setindividual_randvar'] = 'Для случайных величин настройка отдельных элементов не поддерживается.';
$string['error_setindividual_string'] = 'Отдельные символы строки изменть нельзя.';
$string['error_setinlist'] = 'Синтаксическая ошибка: множества нельзя использовать внутри списка.';
$string['error_setnested'] = 'Синтаксическая ошибка: множества не могут быть вложенными.';
$string['error_sort_samesize'] = 'При вызове функции sort() с двумя списками их размеры должны быть одинаковыми.';
$string['error_sort_twolists'] = 'При вызове функции sort() с двумя аргументами они оба должны быть списками.';
$string['error_stacksize'] = 'После вычисления стек должен содержать ровно один элемент — вы, может быть, где-то забыли поставить точку с запятой?';
$string['error_stepzero'] = 'Синтаксическая ошибка: шаг диапазона не может быть равен нулю.';
$string['error_str_argument'] = 'Функция str() ожидает скалярный аргумент, например, число.';
$string['error_strayparen'] = 'Несбалансированная скобка, обнаружен лишний символ «{$a}».';
$string['error_string_for_algebraic_formula'] = 'Недопустимый формат ответа: для типа ответа «алгебраическая формула» ожидается либо одна строка, заключённая в кавычки, либо список строк, каждая из которых заключена в кавычки.';
$string['error_subexpression_empty'] = 'Подвыражение пусто.';
$string['error_sublist_indices'] = 'Функция sublist() ожидает, что индексы будут целыми числами, но обнаружено Функция sublist() ожидает, что индексы будут целыми числами, но обнаружено «{$a}».';
$string['error_sublist_lists'] = 'Функция sublist() ожидает в качестве аргументов списки.';
$string['error_sublist_outofrange'] = 'Индекс {$a} выходит за пределы диапазона в функции sublist().';
$string['error_sum_argument'] = 'Функция sum() ожидает список чисел.';
$string['error_syntax'] = 'Ошибка синтаксиса.';
$string['error_ternary_incomplete'] = 'Синтаксическая ошибка: неполный тернарный оператор или неправильно расположенный символ «?».';
$string['error_ternary_missmiddle'] = 'Синтаксическая ошибка: в тернарном операторе отсутствует средняя часть.';
$string['error_ternary_notenough'] = 'Ошибка вычисления: недостаточно аргументов для тернарного оператора.';
$string['error_tokenconversion'] = 'Указанное значение «{$a}» имеет недопустимый тип данных и не может быть преобразовано в токен.';
$string['error_undefinedconstant'] = 'Неопределённая константа: «{$a}»';
$string['error_unexpectedend'] = 'Синтаксическая ошибка: неожиданное завершение выражения после «{$a}».';
$string['error_unexpectedinput'] = 'Неожиданное входное значение: «{$a}».';
$string['error_unexpectedtoken'] = 'Неожиданный токен: {$a}';
$string['error_unit'] = 'Ошибка анализа единиц';
$string['error_unitpenalty'] = 'Штраф должен быть числом от 0 до 1.';
$string['error_unknownfunction'] = 'Неизвестная функция: «{$a}»';
$string['error_unknownvarname'] = 'Неизвестная переменная: {$a}';
$string['error_unterminatedstring'] = 'Незавершенная строка, начинающаяся в строке {$a->row}, столбце {$a->column}.';
$string['error_validation_eval'] = 'Проверьте ошибку оценки.';
$string['error_variablelhs'] = 'Слева в выражении присваивания должна стоять переменная.';
$string['error_vars_array_index_nonnumeric'] = 'Нечисловое значение не может использоваться как индекс списка.';
$string['error_vars_array_index_out_of_range'] = 'Индекс списка вне диапазона.';
$string['error_vars_array_size'] = 'Размер списка должен быть в пределах от 1 до 1000.';
$string['error_vars_array_type'] = 'Элементы в списке должны быть одного типа (либо число, либо строка).';
$string['error_vars_array_unsubscriptable'] = 'Переменная не поддерживает индексацию.';
$string['error_vars_bracket_mismatch'] = 'Несоответствие скобок.';
$string['error_vars_end_separator'] = 'Отсутствует разделитель присваиваний в конце.';
$string['error_vars_name'] = 'Синтаксис имени переменной неверен.';
$string['error_vars_reserved'] = 'Функция {$a}() зарезервирована и не может использоваться в качестве переменной.';
$string['error_vars_string'] = 'Ошибка! Либо строка без закрывающей двойной кавычки, либо использование неприемлемого символа, такого как \'.';
$string['error_vars_undefined'] = 'Переменная «{$a}» не была определена.';
$string['error_wrapnumber'] = 'Невозможно преобразовать нечисловое значение в ЧИСЛОВОЙ токен.';
$string['error_wrapstring'] = 'Невозможно преобразовать заданное значение в СТРОКОВЫЙ токен.';
$string['feedback'] = 'Общая часть отзыва';
$string['feedback_help'] = 'Эта часть отзыва будет показана всем студентам. Он может включать глобальные и локальные переменные, которые будут заменены их значениями.';
$string['functiontakesatleasttwo'] = 'Функция {$a} должна иметь как минимум два аргумента';
$string['functiontakesnoargs'] = 'Функция {$a} не принимает аргументов';
$string['functiontakesonearg'] = 'Функция {$a} должна иметь только один аргумент';
$string['functiontakesoneortwoargs'] = 'Функция {$a} должна иметь один или два аргумента';
$string['functiontakesthreeargs'] = 'Функция {$a} должна иметь только три аргумента';
$string['functiontakestwoargs'] = 'Функция {$a} должна иметь только два аргумента';
$string['globalvarshdr'] = 'Переменные';
$string['illegalformulasyntax'] = 'Неверный синтаксис формулы, начинающийся с «{$a}»';
$string['incorrectfeedback'] = 'За любой неправильный ответ';
$string['incorrectfeedback_help'] = 'Этот отзыв будет показан студентам, которые не получили никакой оценки за эту часть. Он может включать глобальные и локальные переменные, которые будут заменены их значениями.';
$string['instantiate'] = 'Создать экземпляр';
$string['mainq'] = 'Основной вопрос';
$string['modelanswer'] = 'Модель ответов';
$string['none'] = 'Ничего';
$string['number'] = 'Число';
$string['number_unit'] = 'Число и единица измерения';
$string['numdataset'] = 'Число из набора данных';
$string['numeric'] = 'Числовой';
$string['numeric_unit'] = 'Число и единица измерения';
$string['numerical_formula'] = 'Числовая формула';
$string['numerical_formula_unit'] = 'Числовая формула и единица измерения';
$string['otherrule'] = 'Другие правила';
$string['otherrule_help'] = 'Здесь автор вопроса может задать дополнительные правила преобразования для других распространенных базовых единиц. Смотрите документацию для эффективного использования.';
$string['partiallycorrectfeedback'] = 'Для любого частично правильного ответа';
$string['partiallycorrectfeedback_help'] = 'Этот отзыв будет показан студентам, которые не получили максимальную оценку в этой части. Он может включать глобальные и локальные переменные, которые будут заменены их значениями.';
$string['placeholder'] = 'Название заполнителя';
$string['placeholder_help'] = 'Заполнитель используется для определения в основном вопросе местоположения
текста, который будет заменен содержимым части. Это строка буквенно-цифровых символов с префиксом \'**#**\', таких как #1, #2a, #2b и #A.

Если это поле оставить пустым, то часть будет добавлена после текста основного вопроса.';
$string['pleaseputananswer'] = 'Поставьте ответ в каждом поле ввода.';
$string['pluginname'] = 'Формулы';
$string['pluginname_help'] = 'Чтобы начать использовать этот вопрос, перейдите по ссылке <a href="https://dynamiccourseware.org/">dynamiccourseware.org</a>.

С возможными вопросами обращайтесь по ссылке <a href="https://dynamiccourseware.org/">dynamiccourseware.org</a>.

Чтобы ознакомиться с параметрами в форме редактирования ниже, перейдите по ссылке <a href="https://dynamiccourseware.org/">dynamiccourseware.org</a>.

Полную документацию можно найти по ссылке <a href="https://dynamiccourseware.org/">dynamiccourseware.org</a>.';
$string['pluginname_link'] = 'question/type/formulas';
$string['pluginnameadding'] = 'Добавление вопроса «Формулы»';
$string['pluginnameediting'] = 'Редактирование вопроса «Формулы»';
$string['pluginnamesummary'] = 'Тип вопроса со случайными значениями и несколькими ответами.
Поля ответов могут быть размещены где угодно, чтобы создавать вопросы, содержащие различные структуры, такие как векторы, полиномы и матрицы.
Другие функции, такие как проверка единиц и вопросы из нескольких частей, также тесно интегрированы и просты в использовании.';
$string['postunit'] = 'Единица измерения';
$string['postunit_help'] = 'Здесь можно указать единицу измерения. Данный тип вопроса специально разработан для единиц системы СИ, поэтому пустое место обозначает произведение различных базовых единиц, а <tt>^</tt> используется для обозначения степени. Также можно использовать <tt>/</tt>
для обратной степени. Любые перестановки базовых единиц обрабатываются одинаково.
Студенты должны использовать одинаковый формат ввода.
Примеры:
<pre class="prettyprint">1 м<br>0,1 м^2<br>20 м с^(-1)<br>400 кг м/с<br>100 кВт</pre>';
$string['previewerror'] = 'Предварительный просмотр недоступен. Проверьте определение случайных переменных, глобальных переменных, локальных переменных частей и ответы. Исходное сообщение об ошибке: {$a}';
$string['privacy:metadata'] = 'Плагин типа вопроса «Формулы» не хранит никаких личных данных.';
$string['qtextpreview'] = 'Предварительный просмотр';
$string['questiontext'] = 'Текст вопроса';
$string['questiontext_help'] = 'В дополнение к обычному тексту вопроса, вы также можете использовать здесь глобальные переменные и заполнители.

Глобальные переменные будут заменены их значениями, а заполнители будут заменены частями.
Простой пример с переменными <tt> A, B, C </tt> и заполнителями <tt> #1, #2, #3 </tt>:

<pre class = "prettyprint">Чему равно {A} + {B}? <br>{#1}<br>Чему равно {A} - {B}? <br> {#2}<br>Каков результат {C} / {B}?<br>{#3} </pre>';
$string['relerror'] = 'Относительная ошибка';
$string['renew'] = 'Обновить';
$string['response_right'] = 'Верно';
$string['response_wrong'] = 'Неверно';
$string['response_wrong_unit'] = 'Верное значение, неверная единица измерения';
$string['response_wrong_value'] = 'Неверное значение, верная единица измерения';
$string['ruleid'] = 'Основные правила конвертации';
$string['ruleid_help'] = 'Этот тип вопроса имеет встроенную систему преобразования единиц измерения и основные правила конвертации.

Основными из них являются правила «системы единиц СИ», по которым значения будут преобразованы в стандартные единицы. Например, единицы измерения длины: км, м, см и мм.
Эта опция не эффективна, если единицы измерения не использовались.';
$string['settingallowdecimalcomma'] = 'Региональный разделитель десятичных знаков - запятая';
$string['settingallowdecimalcomma_desc'] = 'Разрешите всем учащимся использовать запятую в качестве десятичного разделителя в ответах.<br>При активном параметре числа будут отображаться в соответствии с языковыми настройками.';
$string['settingdebouncedelay'] = 'Задержка перед оперативной проверкой.';
$string['settingdebouncedelay_desc'] = 'Временной промежуток между последним изменением поля ответа и проверкой данных в режиме реального времени.';
$string['settinglenientimport'] = 'Мягкий контроль при импорте';
$string['settinglenientimport_desc'] = 'При импорте вопроса не проверяется, получат ли предоставленные образцы ответов максимальный балл. <br>Примечание: эту настройку следует активировать только временно.';
$string['settings_heading_general'] = 'Общие настройки';
$string['settings_heading_tooltip'] = 'Всплывающие подсказки';
$string['settings_heading_width'] = 'Ширина по умолчанию';
$string['settings_heading_width_desc'] = 'Ширина полей ввода по умолчанию для различных типов ответов. Для полей, оставленных пустыми, будут использоваться настройки из файла стилей плагина. Пожалуйста, используйте эти настройки с осторожностью. Слишком маленькие поля могут затруднить учащимся ввод ответов. Обратите внимание, что значок восклицательного знака, отображаемый при вводе неверных ответов, занимает примерно 12 пикселей.';
$string['settingshownumbertooltip'] = 'Показать всплывающую подсказку «Число»';
$string['settingshownumbertooltip_desc'] = 'Следует ли отображать всплывающую подсказку с указанием «Число» для данного типа ответа. Возможно, целесообразно не показывать эту подсказку, например, при работе с детьми в начальной школе. Этот параметр не влияет на всплывающие подсказки для других типов ответов или для комбинированных полей.';
$string['settingusepopup'] = 'Использовать подсказки';
$string['settingusepopup_desc'] = 'Отобразить правильный ответ и отзыв во всплывающей подсказке';
$string['subqoptions'] = 'Дополнительные параметры';
$string['subqtext'] = 'Текст части';
$string['subqtext_help'] = 'Здесь можно указать текст части ответов и расположение их полей. Для указания мест расположения полей ответов можно использовать следующие заполнители:

<pre class="prettyprint">{_0}<br>{_1}<br>{_2}<br>...<br>{_u}</pre>

<tt>{_0}, {_1}, {_2}</tt> — это различные поля ввода значений, а <tt>{_u}</tt> — поле ввода единицы измерения.

Все отсутствующие поля автоматически добавляются в конец текста части. Особый случай: если <tt>{_0}</tt> и <tt>{_u}</tt> указаны подряд без пробела,
и имеется только одно поле ответа и одна единица измерения, т. е. <tt>{_0}{_u}</tt>, они будут объединены в одно длинное поле ввода ответа, предназначенное как для ответа, так и для единицы измерения.';
$string['tooltiptrigger'] = 'Всплывающие подсказки';
$string['tooltiptrigger_desc'] = 'В каких случаях следует показывать всплывающие подсказки?';
$string['triggerboth'] = 'При наведении курсора мыши и при фокусировке';
$string['triggerdisabled'] = 'Без всплывающих подсказок';
$string['triggerhover'] = 'Только при наведении курсора мыши';
$string['uniquecorrectansweris'] = 'Правильный ответ: {$a}';
$string['unit'] = 'Единица измерения';
$string['unitpenalty'] = 'Штраф за неправильную единицу измерения (0–1)*';
$string['unitpenalty_help'] = 'Этот параметр определяет количество баллов, которое будет снято со студента за неправильную единицу измерения.

Значение параметра может варьироваться от 0 до 1. Если значение равно 1, то для получения баллов и единица измерения, и ответ должны быть правильными; единица измерения и ответ рассматриваются как одно целое.
С другой стороны, если значение установлено на 0,  студенты могут получить полный балл и только за правильный ответ (в поле «Единица измерения» можно ввести любую произвольную строку, и это
не повлияет на оценку).

Поэтому рекомендуется использовать значение 1 во всех случаях, когда у ответа нет связанной единицы измерения.';
$string['unsupportedformulafunction'] = 'Функция {$a} не поддерживается.';
$string['vars1'] = 'Локальные переменные';
$string['vars1_help'] = 'Здесь можно определить переменные так же, как и глобальные переменные на уровне вопроса. Определённые здесь переменные могут использоваться в ответе или отзыве к части вопроса,
и область их видимости ограничена этой частью.';
$string['vars2'] = 'Оценочные переменные';
$string['vars2_help'] = 'Здесь можно использовать все локальные переменные и ответы учащегося. Более подробную информацию о расширенных возможностях см. в документации.';
$string['vars2_link'] = 'https://dynamiccourseware.org/';
$string['varsdata'] = 'Созданные наборы данных';
$string['varsglobal'] = 'Глобальные переменные';
$string['varsglobal_help'] = 'Здесь можно задать формулы для работы с созданными случайными переменными
(здесь доступны все случайные переменные). Полный список математических
функций и операторов приведен в документации.

<pre class="prettyprint">a = 1.11111;<br>b = exp(3);<br>c = A + a + b;<br>d = sin(1.5*pi) + c;<br>e = round(a, 0);<br>f = [0,1,2,3] [A];<br>g = [«zero»,«one»,„two“,«three»][A];<br>distance = sqrt(a**2 + b**2);</pre>';
$string['varsglobal_link'] = 'https://dynamiccourseware.org/';
$string['varsrandom'] = 'Случайные переменные';
$string['varsrandom_help'] = 'Новые случайные значения генерируются для этих переменных в начале каждой попытки. Это может
быть сделано путем определения набора элементов для выбора:

<pre class="prettyprint">A = {1,2,3};<br>C = {[1,-1], [2,-2], [3,-3]};<br>E = {10:100:10, 100, 1000};</pre>

Элементы могут быть числами, строками или списками из них. В начале новой попытки один элемент будет взят из набора и назначен переменной, расположенной слева. Кроме того, для набора чисел можно использовать обозначение диапазона, например, 10:100:10 (см. выше пример E). </p>';
$string['varsrandom_link'] = 'https://dynamiccourseware.org/';
$string['varsstatistics'] = 'Статистика';
$string['yougotnright'] = 'Вы правильно ответили на {$a} части (-ей) этого вопроса.';
$string['yougotoneright'] = 'Вы правильно ответили на 1 часть этого вопроса.';
